![cover](cover/10.%20GroupBy%20Function.png)

#### Outline
* GroupBy
* Set Group

### GroupBy

This function allows us to split our data into groups based on the values of one or more columns

##### Import Pandas

In [1]:
import pandas

##### Import Datasets

In [2]:
students = pandas.read_csv('./datasets/students.csv')
language_learners = pandas.read_csv('./datasets/language_learners.csv')

### groupby

`groupby(column(s))`

Splits data into groups

To access:
`.group`

In [3]:
students

   first_name   surname sex date_of_birth
0        Emma   Johnson   F    2001-03-15
1        Liam     Brown   M    2003-07-22
2      Olivia    Garcia   F    2002-11-05
3        Noah    Miller   M    2004-09-30
4         Ava     Davis   F    2000-12-11
5       Ethan  Martinez   M    2002-04-19
6      Sophia    Wilson   F    2005-01-28
7       Mason  Anderson   M    2003-06-10
8    Isabella    Thomas   F    2001-08-23
9       Logan    Taylor   M    2004-05-07
10        Mia     Moore   F    2000-02-17
11      Lucas   Jackson   M    2005-10-02

In [4]:
students.groupby('sex').groups

{'F': [0, 2, 4, 6, 8, 10], 'M': [1, 3, 5, 7, 9, 11]}

In [5]:
language_learners

     name  language level  years_practiced
0   Alice   English    C2               12
1   Alice   Spanish    B2                5
2   Alice    French    B1                2
3   Alice    German    A2                1
4   Alice    Arabic    B1                2
5     Bob   English    C1               10
6     Bob    French    B2                7
7     Bob   Italian    B1                4
8     Bob      Urdu    A2                3
9   Carol   English    B2                8
10  Carol   Spanish    C1                9
11  Carol    French    C2               10
12  Carol  Japanese    A2                3
13  David   English    B1                7
14  David    German    C2               14
15  David   Spanish    B2                6
16  David    Arabic    B2                5
17   Emma   English    B2                9
18   Emma   Spanish    B1                4
19   Emma      Urdu    A2                2
20  Frank   English    C1               11
21  Frank    German    B2                8
22  Frank    Arabic    B1                4
23  Grace   English    B2                7
24  Grace    French    B1                3
25  Grace   Italian    A2                2
26  Grace      Urdu    B1                3

In [6]:
language_learners.groupby('language').groups

{'Arabic': [4, 16, 22], 'English': [0, 5, 9, 13, 17, 20, 23], 'French': [2, 6, 11, 24], 'German': [3, 14, 21], 'Italian': [7, 25], 'Japanese': [12], 'Spanish': [1, 10, 15, 18], 'Urdu': [8, 19, 26]}

In [7]:
language_learners.groupby('years_practiced').groups

{1: [3], 2: [2, 4, 19, 25], 3: [8, 12, 24, 26], 4: [7, 18, 22], 5: [1, 16], 6: [15], 7: [6, 13, 23], 8: [9, 21], 9: [10, 17], 10: [5, 11], 11: [20], 12: [0], 14: [14]}

In [8]:
language_learners.groupby('level').groups

{'A2': [3, 8, 12, 19, 25], 'B1': [2, 4, 7, 13, 18, 22, 24, 26], 'B2': [1, 6, 9, 15, 16, 17, 21, 23], 'C1': [5, 10, 20], 'C2': [0, 11, 14]}

In [9]:
language_learners.groupby('language')['years_practiced'].mean().round(2)

language
Arabic      3.67
English     9.14
French      5.50
German      7.67
Italian     3.00
Japanese    3.00
Spanish     6.00
Urdu        2.67
Name: years_practiced, dtype: float64

In [10]:
language_learners.groupby('level')['years_practiced'].mean().round(2)

level
A2     2.20
B1     3.62
B2     6.88
C1    10.00
C2    12.00
Name: years_practiced, dtype: float64

In [12]:
language_learners.groupby('name')['language'].count()

name
Alice    5
Bob      4
Carol    4
David    4
Emma     3
Frank    3
Grace    4
Name: language, dtype: int64

### get_group

`groupby().get_group(n)`

Creates a dataframe from the desired group

In [13]:
languages = language_learners.groupby('language')
languages.get_group('English')

     name language level  years_practiced
0   Alice  English    C2               12
5     Bob  English    C1               10
9   Carol  English    B2                8
13  David  English    B1                7
17   Emma  English    B2                9
20  Frank  English    C1               11
23  Grace  English    B2                7

In [14]:
levels = language_learners.groupby('level')
levels.get_group('C2')

     name language level  years_practiced
0   Alice  English    C2               12
11  Carol   French    C2               10
14  David   German    C2               14

In [15]:
levels.get_group('A2')

     name  language level  years_practiced
3   Alice    German    A2                1
8     Bob      Urdu    A2                3
12  Carol  Japanese    A2                3
19   Emma      Urdu    A2                2
25  Grace   Italian    A2                2

In [16]:
people = language_learners.groupby('name')
people.get_group('Alice')

    name language level  years_practiced
0  Alice  English    C2               12
1  Alice  Spanish    B2                5
2  Alice   French    B1                2
3  Alice   German    A2                1
4  Alice   Arabic    B1                2

In [17]:
people.get_group('David')

     name language level  years_practiced
13  David  English    B1                7
14  David   German    C2               14
15  David  Spanish    B2                6
16  David   Arabic    B2                5

### For Source code:
https://sites.google.com/view/aorbtech/programming/

#### @Aorb Tech